Revit 2024 API
FabricationPart.OptimizeLengths Method
 Optimizes the length fabrication straight parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static ISet<ElementId> OptimizeLengths(
	Document document,
	ISet<ElementId> partIds
)
Visual Basic
Public Shared Function OptimizeLengths ( _
	document As Document, _
	partIds As ISet(Of ElementId) _
) As ISet(Of ElementId)
Visual C++
public:
static ISet<ElementId^>^ OptimizeLengths(
	Document^ document,
	ISet<ElementId^>^ partIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
partIds
Type: System.Collections.Generic.ISet<ElementId>
 The identifiers of the fabrication parts in a selected fabrication part run.
Return Value
 New and modified fabrication part ids in the optimize
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  There are no straight parts to optimize, or all parts are locked or locked by group membership.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  this operation failed.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace